In [1]:
import requests
import pandas as pd

# script for returning elevation from lat, long, based on open elevation data
# which in turn is based on SRTM
def get_elevation(lat, long):
    query = ('https://api.open-elevation.com/api/v1/lookup'
             f'?locations={lat},{long}')
    r = requests.get(query).json()  # json object, various ways you can extract value
    # one approach is to use pandas json functionality:
    elevation = pd.io.json.json_normalize(r, 'results')['elevation'].values[0]
    return elevation

In [13]:
# 21.8
# (41.000546, 28.645943) (41.00748, 28.645884)

get_elevation(41.000546, 28.645943)-get_elevation(41.00748, 28.645884)

C:\Users\OZGUN\AppData\Local\Temp\ipykernel_6784\154497095.py:11: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  elevation = pd.io.json.json_normalize(r, 'results')['elevation'].values[0]

-16

In [11]:
import pandas as pd
df = pd.DataFrame(data=[16,73,445,687,894,9342])

In [27]:
df.shift()

       0
0    NaN
1   16.0
2   73.0
3  445.0
4  687.0
5  894.0

In [28]:
df.loc[1:]

      0
1    73
2   445
3   687
4   894
5  9342

In [36]:
df.shift()-df.loc[1:]

        0
0     NaN
1   -57.0
2  -372.0
3  -242.0
4  -207.0
5 -8448.0

In [35]:
df.diff(-1).shift()

        0
0     NaN
1   -57.0
2  -372.0
3  -242.0
4  -207.0
5 -8448.0